app/controllers/generator_controller.rb

  def form
    @model = UserModel.find(params[:modelid])
---
SELECT `user_models`.* FROM `user_models` WHERE `user_models`.`id` = 28 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def submit

  # get the url of the model being printed :
  model = UserModel.find(params[:generator][:modelid])
---
SELECT `user_models`.* FROM `user_models` WHERE `user_models`.`id` = 28 LIMIT 1