app/controllers/home_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users`
SELECT `user_models`.* FROM `user_models`
---
  def index
  	if session[:id] != nil
  		@user = User.find(session[:id])
  	else
  		@user = User.new
  	end
  	@users = User.all
  	@models = UserModel.all