app/controllers/model_objects_controller.rb

SELECT `user_models`.* FROM `user_models`
---
  def index
  	@models = UserModel.all

SELECT `user_models`.* FROM `user_models` WHERE `user_models`.`id` = 8 LIMIT 1
---
  def canvas
    @model = UserModel.find(params[:modelid])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def new
    if session[:id] != nil
      @user = User.find(session[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `user_models`.* FROM `user_models` WHERE `user_models`.`id` = 8 LIMIT 1
---
  def single

    # Look into making this code more dry here...

    if session[:id] != nil
      @user = User.find(session[:id])
    else
      @user = User.new
    end

    @model = UserModel.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---

    @searchedFor = params[:search][:text]
    if session[:id] != nil
      @user = User.find(session[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
INSERT INTO `user_models` (`category`, `created_at`, `description`, `name`, `stlfile_content_type`, `stlfile_file_name`, `stlfile_file_size`, `stlfile_updated_at`, `thumbnail_content_type`, `thumbnail_file_name`, `thumbnail_file_size`, `thumbnail_updated_at`, `updated_at`) VALUES ('3', '2014-02-16 01:11:44', 'Sofa for your living room', 'Test', 'application/octet-stream', '60sSofa_Leg.stl', 5068, '2014-02-16 01:11:44', 'image/jpeg', 'cleaning-sofa.jpg', 139418, '2014-02-16 01:11:44', '2014-02-16 01:11:44')
UPDATE `user_models` SET `user_id` = 4, `updated_at` = '2014-02-16 01:11:45' WHERE `user_models`.`id` = 17
UPDATE `users` SET `name` = NULL, `updated_at` = '2014-02-16 02:02:40' WHERE `users`.`id` = 4
---
  def create


    @user = User.find(session[:id])
    @currentModel = UserModel.new
    @currentModel.update_attributes(params[:currentModel].permit!)
    modelname = params[:currentModel][:name]
    @user.user_models << @currentModel
    @user.save!