app/controllers/navbar_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'lucaszw' LIMIT 1
---
  def create
    correct = "false"

    @user = User.find_by name: params[:user][:name]