app/controllers/profiles_controller.rb

	def create
		@user = User.new(:name => params[:user][:name] ,
			:password => params[:user][:password], :sketchfab_token => params[:user][:sketchfab_token])
		session[:id] = @user.id
		session[:username] = @user.name
		@user.save
---
INSERT INTO `users` (`created_at`, `name`, `password`, `sketchfab_token`, `updated_at`) VALUES ('2014-02-23 08:04:44', 'luklonium', 'master', '', '2014-02-23 08:04:44')

	def edit
		@user = User.find(session[:id])
		@models = @user.user_models.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `user_models`.* FROM `user_models` WHERE `user_models`.`user_id` = 4

	def update
		@user = User.find(session[:id])
		@user.name = params[:user][:name]
		@user.password = params[:user][:password]
		@user.sketchfab_token = params[:user][:sketchfab_token]
		@user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
UPDATE `users` SET `name` = 'lucaszw', `sketchfab_token` = NULL, `updated_at` = '2014-03-02 20:32:32' WHERE `users`.`id` = 9